In [1]:
import pandas as pd
import numpy as np

In [3]:
first_series = pd.Series(list('abcdeg'))
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    g
dtype: object

In [8]:
scores1 = [77,11,53,65,76]
scores2 = [23,56,23,82,55]
students1 = ['afiq', 'yazid', 'sarah','haikal','ahmad']
students2 = ['afiq', 'yazid', 'sarah','john','elton']

series1 = pd.Series(scores,index=students1)
series2 = pd.Series(scores2,index=students1)
series3 = pd.Series(scores2,index=students2)

series1+series3

afiq      100.0
ahmad       NaN
elton       NaN
haikal      NaN
john        NaN
sarah      76.0
yazid      67.0
dtype: float64

In [12]:
print(series1.iloc[0])
print(series1.loc['afiq'])

77
77

In [23]:
olympic = {
    'Host':['London', 'Beijing','Athens','Sydney','Atlanta','Malaysia'],
    'Year':[2012,2008,200,2000,1996,2020],
    'No. Paricipants':[205,204,201,200,197,10]
}

df_olympic = pd.DataFrame(olympic)

In [24]:
df_olympic

       Host  Year  No. Paricipants
0    London  2012              205
1   Beijing  2008              204
2    Athens   200              201
3    Sydney  2000              200
4   Atlanta  1996              197
5  Malaysia  2020               10

In [25]:
olympic_data = {
    'London':{2012:205,2008:199},
    'Beijing':{2008:204,2012:100}
}
df_olympic_data = pd.DataFrame(olympic_data)
df_olympic_data

      London  Beijing
2012     205      100
2008     199      204

In [28]:
df_olympic['Year'].tail()

1    2008
2     200
3    2000
4    1996
5    2020
Name: Year, dtype: int64

In [30]:
df_olympic.describe

<bound method NDFrame.describe of        Host  Year  No. Paricipants
0    London  2012              205
1   Beijing  2008              204
2    Athens   200              201
3    Sydney  2000              200
4   Atlanta  1996              197
5  Malaysia  2020               10>

In [31]:
df_olympic.dtypes

Host               object
Year                int64
No. Paricipants     int64
dtype: object

In [41]:
states=['Johor','Selangor','Sabah','Kedah','Perlis']
populations=[101,542,5632,123,531]
capitals=['JB','SA','KK','SP','Perlis']

population_in_series=pd.Series(populations,index=states)
capitals_state=pd.Series(capitals,index=states)

In [42]:
population_in_series

Johor        101
Selangor     542
Sabah       5632
Kedah        123
Perlis       531
dtype: int64

In [43]:
capitals_state

Johor           JB
Selangor        SA
Sabah           KK
Kedah           SP
Perlis      Perlis
dtype: object

In [47]:
df_states = pd.DataFrame({
    'Populations':population_in_series,
    'Capital-city':capitals_state
})
df_states

          Populations Capital-city
Johor             101           JB
Selangor          542           SA
Sabah            5632           KK
Kedah             123           SP
Perlis            531       Perlis

In [48]:
import pandas as pd

df_movie_rating = pd.DataFrame(
    {'movie 1': [5, 4, 3, 3, 2, 1],
     'movie 2': [4, 5, 2, 3, 4, 2]},
    index=['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul']
)

def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    if rating == 2:
        return 'D'
    else:
        return 'F'

In [49]:
print(movie_grade(5))

A

In [50]:
df_movie_rating.applymap(movie_grade)

C:\Users\Muhammad Afiq\AppData\Local\Temp\ipykernel_6964\3508546455.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       D
Ram         C       C
Ted         D       B
Paul        F       D

## Pandas SQL